output/2023-07-24-18-01.log
Benchmark_Config
1000,100,1024
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        1044 bytes

Concurrency Level:      100
Time taken for tests:   0.422 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      1208000 bytes
Total body sent:        1214000
HTML transferred:       1044000 bytes
Requests per second:    2367.27 [#/sec] (mean)
Time per request:       42.243 [ms] (mean)
Time per request:       0.422 [ms] (mean, across all concurrent requests)
Transfer rate:          2792.64 [Kbytes/sec] received
                        2806.51 kb/s sent
                        5599.16 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   6.6      0      27
Processing:     1   35  18.7     34      92
Waiting:        1   34  18.7     34      92
Total:          1   37  21.4     34      92
Benchmark_Config
1000,100,1024
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        1044 bytes

Concurrency Level:      100
Time taken for tests:   0.437 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      1208000 bytes
Total body sent:        1214000
HTML transferred:       1044000 bytes
Requests per second:    2287.97 [#/sec] (mean)
Time per request:       43.707 [ms] (mean)
Time per request:       0.437 [ms] (mean, across all concurrent requests)
Transfer rate:          2699.09 [Kbytes/sec] received
                        2712.50 kb/s sent
                        5411.59 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   6.9      0      28
Processing:     9   38  14.6     38     110
Waiting:        9   38  14.6     38     110
Total:          9   40  15.2     40     110
Benchmark_Config
1000,100,2048
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        2068 bytes

Concurrency Level:      100
Time taken for tests:   0.510 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      2232000 bytes
Total body sent:        2238000
HTML transferred:       2068000 bytes
Requests per second:    1961.94 [#/sec] (mean)
Time per request:       50.970 [ms] (mean)
Time per request:       0.510 [ms] (mean, across all concurrent requests)
Transfer rate:          4276.41 [Kbytes/sec] received
                        4287.91 kb/s sent
                        8564.32 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   5.4      0      30
Processing:    11   47  29.2     36     143
Waiting:        3   47  29.2     36     143
Total:         11   48  28.7     39     143
Benchmark_Config
1000,100,4096
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        4116 bytes

Concurrency Level:      100
Time taken for tests:   0.374 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      4280000 bytes
Total body sent:        4286000
HTML transferred:       4116000 bytes
Requests per second:    2674.83 [#/sec] (mean)
Time per request:       37.386 [ms] (mean)
Time per request:       0.374 [ms] (mean, across all concurrent requests)
Transfer rate:          11179.97 [Kbytes/sec] received
                        11195.64 kb/s sent
                        22375.61 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   2.7      0      17
Processing:     6   33  16.0     29     117
Waiting:        6   33  16.0     28     117
Total:          6   34  15.5     29     117
Benchmark_Config
1000,100,8192
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        8212 bytes

Concurrency Level:      100
Time taken for tests:   0.790 seconds
Complete requests:      1000
Failed requests:        19
   (Connect: 0, Receive: 0, Length: 19, Exceptions: 0)
Non-2xx responses:      19
Keep-Alive requests:    1000
Total transferred:      8220751 bytes
Total body sent:        8382000
HTML transferred:       8056542 bytes
Requests per second:    1265.82 [#/sec] (mean)
Time per request:       79.000 [ms] (mean)
Time per request:       0.790 [ms] (mean, across all concurrent requests)
Transfer rate:          10162.08 [Kbytes/sec] received
                        10361.41 kb/s sent
                        20523.50 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   3.5      0      15
Processing:     4   74  80.3     45     479
Waiting:        4   74  80.3     45     479
Total:          4   76  79.6     46     479